Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraints.Start Property
 Data related to the first part end.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisRestraintData Start { get; set; }
Public Property Start As AnalysisRestraintData
	Get
	Set
Property Value
Type: AnalysisRestraintData
See Also
Reference
AnalysisRestraints Class
Tekla.Structures.Analysis Namespace